In [1]:
import pandas as pd

C:\Users\Zahid Mehmood\AppData\Local\Temp\ipykernel_17036\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = {
    'id':[1,2,3,4,5,6,7,8,9],
    'marks':[20,34,5,6,67,8,5,67,24],
    'name':['Talal','Bilal','Shaheer','Ibrahim','Umar','Ehsan','Zahid','Iqbal','Ahmad'],
    'date':pd.daterange('20240303',periods= 9)
}

AttributeError: module 'pandas' has no attribute 'daterange'

In [3]:
df = {
    'id':[1,2,3,4,5,6,7,8,9],
    'marks':[20,34,5,6,67,8,5,67,24],
    'name':['Talal','Bilal','Shaheer','Ibrahim','Umar','Ehsan','Zahid','Iqbal','Ahmad'],
    'date':pd.date_range('20240303',periods= 9)
}

In [4]:
df

{'id': [1, 2, 3, 4, 5, 6, 7, 8, 9],
 'marks': [20, 34, 5, 6, 67, 8, 5, 67, 24],
 'name': ['Talal',
  'Bilal',
  'Shaheer',
  'Ibrahim',
  'Umar',
  'Ehsan',
  'Zahid',
  'Iqbal',
  'Ahmad'],
 'date': DatetimeIndex(['2024-03-03', '2024-03-04', '2024-03-05', '2024-03-06',
                '2024-03-07', '2024-03-08', '2024-03-09', '2024-03-10',
                '2024-03-11'],
               dtype='datetime64[ns]', freq='D')}

In [5]:
df = pd.DataFrame(df)

In [6]:
df

   id  marks     name       date
0   1     20    Talal 2024-03-03
1   2     34    Bilal 2024-03-04
2   3      5  Shaheer 2024-03-05
3   4      6  Ibrahim 2024-03-06
4   5     67     Umar 2024-03-07
5   6      8    Ehsan 2024-03-08
6   7      5    Zahid 2024-03-09
7   8     67    Iqbal 2024-03-10
8   9     24    Ahmad 2024-03-11

In [7]:
df['age']=[14,3,4,2,5,67,6,8,7]

In [8]:
df

   id  marks     name       date  age
0   1     20    Talal 2024-03-03   14
1   2     34    Bilal 2024-03-04    3
2   3      5  Shaheer 2024-03-05    4
3   4      6  Ibrahim 2024-03-06    2
4   5     67     Umar 2024-03-07    5
5   6      8    Ehsan 2024-03-08   67
6   7      5    Zahid 2024-03-09    6
7   8     67    Iqbal 2024-03-10    8
8   9     24    Ahmad 2024-03-11    7

In [9]:
df.describe()

             id      marks                 date        age
count  9.000000   9.000000                    9   9.000000
mean   5.000000  26.222222  2024-03-07 00:00:00  12.888889
min    1.000000   5.000000  2024-03-03 00:00:00   2.000000
25%    3.000000   6.000000  2024-03-05 00:00:00   4.000000
50%    5.000000  20.000000  2024-03-07 00:00:00   6.000000
75%    7.000000  34.000000  2024-03-09 00:00:00   8.000000
max    9.000000  67.000000  2024-03-11 00:00:00  67.000000
std    2.738613  25.178253                  NaN  20.593958

In [11]:
df2 = pd.DataFrame(
    {'food_item':['rice','bread','sugar','ghee'],
     'price_2023':[100,200,300,400]              
}
)

In [12]:
df3 = pd.DataFrame(
    {'food_item':['rice','bread','sugar','ghee'],
     'price_2024':[300,400,500,600]  
    }
)

In [14]:
df4 = pd.merge(df2,df3, on= 'food_item')

In [15]:
df4

  food_item  price_2023  price_2024
0      rice         100         300
1     bread         200         400
2     sugar         300         500
3      ghee         400         600

In [16]:
import numpy as np
pivot_table = pd.pivot_table(df4,values = 'price_2023',index = 'price_2024',columns = 'food_item',aggfunc= np.sum)

C:\Users\Zahid Mehmood\AppData\Local\Temp\ipykernel_17036\1337339112.py:2: FutureWarning: The provided callable <function sum at 0x00000164A4EBB9C0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pivot_table = pd.pivot_table(df4,values = 'price_2023',index = 'price_2024',columns = 'food_item',aggfunc= np.sum)

In [17]:
pivot_table

food_item   bread   ghee   rice  sugar
price_2024
300           NaN    NaN  100.0    NaN
400         200.0    NaN    NaN    NaN
500           NaN    NaN    NaN  300.0
600           NaN  400.0    NaN    NaN

In [18]:
#df.apply()
def square(x):
    return x**2

In [20]:
df4['A_squared'] = df4['price_2024'].apply(square)

In [21]:
df4

  food_item  price_2023  price_2024  A_squared
0      rice         100         300      90000
1     bread         200         400     160000
2     sugar         300         500     250000
3      ghee         400         600     360000